{
  "HomePage": {
    "title": "Hi, I'm",
    "description1": "+3 years of experience as ",
    "description2": "Software Developer",
    "description3": ". +500 ",
    "description4": "GitHub contributions",
    "description5": " last year. Passion for creating innovative solutions with modern technologies. Specialized in web application development. Graduated in ",
    "description6": "Information Technology Engineering",
    "description7": " at ",
    "description8": "Yachay Tech University",
    "description9": ". Going forward I am interested in delving into the world of ",
    "description10": "Data Science",
    "description11": " and ",
    "description12": "Artificial Intelligence",
    "description13": " to broaden the impact of my work. I look forward to connecting and exploring how we can create something exceptional together. Let's start! "
  },
  "Navbar": {
    "home": "Home",
    "development": "Development",
    "courses": "Courses",
    "students": "Students"
  },
  "Projects": {
    "title": "My Projects",
    "infoButtonText": "More info...",
    "liveButtonText": "View live",
    "backButton": "Back",
    "viewCodeButton": "View code",
    "projects": {
      "edf": {
        "description": "",
        "content": {
          "introduction": "A web platform for EDF Academy, an innovative institution dedicated to preparing high school students for higher education through cutting-edge tools like Virtual Reality.",
          "title1": "Tech Stack Mastery:",
          "p1": "This project was an incredible journey in modern web development, where I leveraged a robust tech stack:",
          "item1description": "for dynamic and efficient frontend development.",
          "item2description": "for sleek, responsive design.",
          "item3description": "framework & Vercel for optimal performance and seamless deployment.",
          "item4description": "a versatile collection of React components based on Radix primitives for enhanced UI/UX.",
          "item5description": "for robust database management.",
          "item6description": "for reliable storage of images and videos.",
          "title2": "From Concept to Reality:",
          "p2": "My role spanned the entire development lifecycle - from initial meetings with EDF Academy's founders to understand their vision, through to deploying and integrating new features tailored to the academy's evolving needs.",
          "title3": "Creating Impact:",
          "p3": "This website is more than just a project; it's a gateway for students to access innovative educational tools. It represents a fusion of technology and education, paving the way for future learning experiences."
        }
      },
      "tutou": {
        "description": "Peer Tutoring Platform",
        "content": {
          "introduction": "Tuto-U has successfully transitioned from its developmental phase into a fully operational peer-tutoring web platform, revolutionizing the way students at Yachay Tech engage in collaborative learning. Here’s an overview of its evolving features and achievements:",
          "item1": "Peer-Tutoring Platform:",
          "item1desc": "Tuto-U has established a dynamic community where students connect for tutoring sessions, facilitating knowledge sharing and collaborative learning. This environment empowers students by allowing them to both teach and learn, enriching their educational experience.",
          "item2": "Empowered Student Tutors:",
          "item2desc": "In keeping with its founding principles, Tuto-U continues to enable students to serve as tutors. This peer-to-peer learning model not only enhances academic understanding but also builds leadership and teaching skills among students.",
          "item3": "Advanced Technology Stack:",
          "item3desc": "Utilizing modern technologies like React, TypeScript, and Next.js, Tuto-U offers a robust, scalable, and intuitive user experience. The platform prioritizes accessibility and ease of navigation, making it inclusive for all users.",
          "item4": "Impact and Recognition:",
          "item4desc": "Beyond its functional achievements, Tuto-U has gained recognition for its social impact, notably participating in the Hult Prize competition. The platform aims to tackle educational disparities and foster a local community of learners and educators.",
          "item5": "Expanding Learning Connections:",
          "item5desc": "Tuto-U’s vision extends towards cultivating a expansive connection network inside the Yachay Tech's learning community. It aims to create opportunities for shared growth and development across interdisciplinary connections.",
          "item6": "Status Update:",
          "item6desc": "Tuto-U is actively expanding, continuously integrating new features and enhancements to improve user engagement and educational outcomes.",
          "p2": "This evolution from OrientaYT to Tuto-U marks a significant milestone in my mission to transform educational interactions and build a more connected, educated world."
        }
      },
      "orientayt": {
        "description": "Old Peer Tutoring Platform",
        "content": {
          "introduction": "OrientaYT created an educational ecosystem all about mutual support. It was a peer tutoring platform designed for students, by students. Its mission was to provide Yachay Tech students with an online community where they could find personalized academic help and collaborate in their educational development.",
          "title1": "How it Worked:",
          "p1": "OrientaYT was easy to use. If a student needed assistance, they simply logged in to the platform and searched for available tutors. They could explore tutor profiles, view their areas of expertise, and check their availability schedules. Then, they selected a tutor that suited their needs and scheduled a tutoring session.",
          "p2": "If a student was looking to share their knowledge, they could join the team of volunteer tutors. By becoming a tutor, they had the opportunity to help their peers, build their expertise, and earn achievements for their contribution.",
          "title2": "Screenshots:",
          "p3": "In summary, OrientaYT was an online learning companion, where the community came together to help each other achieve academic success. It was an exciting educational journey. Welcome to the legacy of OrientaYT!"
        }
      },
      "kidneyapp": {
        "description": "Dialysis Sessions Control",
        "content": {
          "introduction": "Kidney app is a web application that allows the control of dialysis sessions for patients with kidney failure. It was developed for a Nephrology Department of a hospital. The main features are:",
          "item1": "Patient Registration:",
          "item1desc": "The app allows the registration of patients with their personal information and medical history.",
          "item2": "Dialysis Sessions Control:",
          "item2desc": "The app allows the registration of dialysis sessions for each patient, including the date, time, clinical parameters, and additional symptoms.",
          "item3": "Charts:",
          "item3desc": "The app allows the visualization of charts with data of the dialysis sessions for each patient in a timeline with clinical parameters.",
          "item4": "Technology Stack:",
          "item4desc": "The platform is built using cutting-edge technologies like React, TypeScript, and Next.js. This ensures a robust, scalable, and user-friendly application. Focus on user experience and accessibility is paramount, making the app inclusive and easy to navigate.",
          "p1": "Obviously this is dummy data, respecting the patient's privacy. The retrieved data is stored in a local SQLite database so it can be used in future for analysis and research purposes by the Nephrology Department using Artificial Intelligence and Machine Learning algorithms to improve the quality of life of patients with kidney failure and to prevent a fully kidney failure.",
          "p2": "Anyways, I upload a functional version of the app in GitHub, so you can check it out and play with it. I hope you like it"
        }
      }
    }
  },
  "Experiences": {
    "title": "My Experiences",
    "moreInfo": "More info...",
    "viewCertificate": "View certificate",
    "close": "Close",
    "1": {
      "title": "Board Member",
      "type": "work",
      "date": "Oct 2020 - Oct 2021",
      "location": "Computational Sciences Club at Yachay Tech University",
      "description": "Director of the Communications Department in the TICs / Computer Science Engineering club."
    },
    "2": {
      "title": "Speaker & Assistant in Fundamentals of Software Engineering Seminar",
      "type": "event",
      "date": "May - Jul 2021",
      "location": "SDAS Research Group",
      "description": "Contributed to sessions on software engineering principles."
    },
    "3": {
      "title": "Tutor in Proyecto Hamilton Tech",
      "type": "event",
      "date": "Nov - Dec 2021",
      "location": "Computational Sciences Club at Yachay Tech University",
      "description": "Mentored high school students in computing subjects."
    },
    "4": {
      "title": "Speaker in Computer Vision Exhibition 2.0",
      "type": "event",
      "date": "Dec 7, 2021",
      "location": "IEEE Computer Society Yachay Tech University",
      "description": "Presented a poster about a Gesture Recognition App based on the TensorFlow Lite Android example."
    },
    "5": {
      "title": "Software Engineering & Computational Sciences Seminar",
      "type": "event",
      "date": "Mar 21 - 25, 2022",
      "location": "",
      "description": "Organized by the Software Club ESPE Latacunga, the Computational Sciences Club at Yachay Tech University, the Computer Society Chapter ESPE Latacunga, and the Computer Society Chapter Yachay Tech."
    },
    "6": {
      "title": "Generative AI Fundamentals",
      "type": "course",
      "date": "Jun 14, 2022",
      "location": "Google Cloud Skills Boost",
      "description": "Certified foundational knowledge in generative AI and its applications."
    },
    "7": {
      "title": "Software Developer Internship",
      "type": "work",
      "date": "Jun - Dec 2022",
      "location": "TALOV",
      "description": "Preprocessed a sign language dataset with data augmentation, collected keypoints from video frames, modeled an LSTM neural network, and trained it with the retrieved keypoints. Used TFLite to create a lightweight model for a mobile app developed in Flutter by another team."
    },
    "8": {
      "title": "Scientific Poster Presentation",
      "type": "event",
      "date": "Jul 10, 2023",
      "location": "I Congreso Internacional de Educación, Ciencias, Innovación y Sociedad (CIECIS23)",
      "description": "Presented a poster titled 'Tutoring Sessions Yachay Tech: web application to promote collective learning,' highlighting the results of my OrientaYT project."
    },
    "9": {
      "title": "NestJS: The Complete Developer's Guide",
      "type": "course",
      "date": "Feb 17, 2024",
      "location": "Udemy",
      "description": "I've successfully completed an 20 hours NestJS backend course, diving deep into TypeORM and expanding my understanding of TypeScript beyond just adding types to variables. This experience has strengthened my skills in backend architecture, modular development, and best practices for building scalable applications."
    }
  },
  "TechStack": {
    "title": "Tech Stack",
    "tier1": "Main Stack",
    "tier1description": "Essencial technologies in my current projects",
    "tier2": "Secondary Techs",
    "tier2description": "Tecnologies learned and used in the past",
    "tier3": "Interesting Techs",
    "tier3description": "Technologies that I have interest in learning in the future"
  },
  "Services": {
    "title": "My Services",
    "learnButtonText": "Learn more",
    "service1": "Personalized Tutoring",
    "service1description": "I offer personalized tutoring sessions in various areas of computational sciences or mathematics, tailored to your specific needs. From topics for children to university students, I ensure directed and effective learning for each student.",
    "service2": "Courses",
    "service2description": "I teach programming courses in front-end, back-end, and full-stack technologies, among other areas. These courses are designed for you to gain solid foundations and practical skills through projects that demonstrate your learning. Certificate included.",
    "service3": "Custom Web Application Development",
    "service3description": "As an experienced developer, I offer design and development services for web applications. From conceptualization to launch, I handle all technical aspects to create robust and efficient applications.",
    "service4": "Database Development and Management",
    "service4description": "Specializing in database design and management, I offer solutions that ensure data integrity, performance, and scalability. Perfect for businesses requiring advanced data storage and real-time analysis."
  },
  "Courses": {
    "title": "My Courses",
    "viewMore": "View more",
    "comingSoon": "Coming Soon",
    "comingSoonDescription": "The page for this course is still being integrated, but you can contact me directly if you need information.",
    "BasicsPython": {
      "title": "Basic Programming with Python",
      "description": "This course introduces the fundamentals of programming using Python, one of the most popular and versatile programming languages. Participants will learn basic concepts such as variables, control structures, functions, and data types. By the end of the course, students will be able to write simple programs, solve problems algorithmically, and understand the core principles of coding. Ideal for beginners with no prior programming experience.",
      "time": "hours",
      "place": "Live",
      "difficulty": "Beginner",
      "certificate": "Includes certificate",
      "learningObjective": {
        "title": "Learning Objectives",
        "1": "Understand and implement basic programming concepts",
        "2": "Write and debug Python programs",
        "3": "Develop problem-solving skills through practical experiences",
        "4": "Create robust and maintainable code"
      },
      "lectures": "lectures",
      "workshops": "workshops",
      "assessments": "assessments",
      "project": "project",
      "investment": "investment",
      "prerequisites": "Prerequisites",
      "req": {
        "1": "None"
      },
      "content": "Content",
      "lecture": "Lecture",
      "workshop": "WorkShop",
      "assessment": "Assessment",
      "lecturesData": {
        "1": "Introduction to Programming & Python",
        "2": "Variables and Data Types",
        "3": "Control structures: conditionals & loops",
        "4": "Introduction to functions",
        "5": "Lists",
        "6": "Working with Strings",
        "7": "Reading/Writting Files",
        "8": "Error Handling"
      },
      "workshopsData": {
        "1": "Writing Your First Python Program",
        "2": "Working with Variables and Data Types",
        "3": "Implementing Control Structures",
        "4": "Creating and Using Functions",
        "5": "Creating Arrays and Matrices",
        "6": "Practical String Manipulation",
        "7": "File Input and Output Operations",
        "8": "Writing Robust Programs with Error Handling"
      },
      "finalProject": "Final Project",
      "obtainCertificate": "Obtain Certificate"
    },
    "Scratch": {
      "title": "Programming for kids with Scratch",
      "description": "Designed for young learners, this course uses Scratch, a visual programming language that makes coding fun and interactive. Children will learn the basics of programming through creating their own games, animations, and interactive stories. This course encourages creativity, logical thinking, and problem-solving skills in an engaging and supportive environment. Perfect for kids aged 8-14.",
      "time": "hours",
      "place": "Live",
      "difficulty": "Beginner",
      "certificate": "Includes certificate",
      "learningObjective": {
        "title": "Learning Objectives",
        "1": "Understand basic programming concepts using Scratch’s visual language",
        "2": "Create interactive stories, games, and animations using Scratch",
        "3": "Develop problem-solving skills by building projects",
        "4": "Gain confidence in presenting and explaining coding projects"
      },
      "lectures": "lectures",
      "workshops": "workshops",
      "assessments": "assessments",
      "project": "project",
      "projects": "projects",
      "investment": "investment",
      "discounts": "Discounts",
      "discountsDescription": "Check the prices per number of students",
      "students": "students",
      "discountsNote": "The maximum number of students per course is 4. This ensures the quality of learning for each student",
      "prerequisites": "Prerequisites",
      "req": {
        "1": "None"
      },
      "content": "Content",
      "lecture": "Lecture",
      "workshop": "WorkShop",
      "assessment": "Assessment",
      "lecturesData": {
        "1": "Introduction to Scratch and the Scratch Interface",
        "2": "Understanding Events and Controls",
        "3": "Introduction to Variables and Loops",
        "4": "Adding Sounds and Music to Projects",
        "5": "Using Conditional Statements",
        "6": "Introduction to Broadcasting and Cloning"
      },
      "workshopsData": {
        "1": "Creating Your First Scratch Project: Make a Sprite Move",
        "2": "Creating Interactive Animations with Events",
        "3": "Building a Simple Game with Variables",
        "4": "Creating a Music-based Game",
        "5": "Creating a Choose-Your-Own-Adventure Story",
        "6": "Building a Multiplayer Game"
      },
      "projectM": "Project",
      "obtainCertificate": "Obtain Certificate"
    },
    "Matplotlib": {
      "title": "Data Visualization with Matplotlib",
      "description": "This course focuses on the art of data visualization using Matplotlib, a powerful Python library. Students will learn how to create a wide range of static, animated, and interactive visualizations. Topics include plotting basic graphs, customizing plots, working with multiple figures and subplots, and integrating with other data analysis libraries. Ideal for those who want to transform data into meaningful insights through compelling visual representations."
    },
    "FrontI": {
      "title": "Front-End (I): HTML, CSS & JavaScript",
      "description": "This foundational course covers the essential technologies for building web pages. Participants will learn HTML for structure, CSS for styling, and JavaScript for interactivity. By the end of the course, students will be able to create responsive and dynamic web pages from scratch. This course is perfect for beginners who want to start their journey in web development."
    },
    "FrontII": {
      "title": "Front-End (II): React, TypeScript & TailwindCSS",
      "description": "Building on basic web development skills, this course dives into modern front-end development with React, TypeScript, and TailwindCSS. Participants will learn to create complex and scalable user interfaces with React, ensure code quality and type safety with TypeScript, and style applications efficiently with TailwindCSS. Ideal for those looking to advance their front-end development skills and work on professional-grade web applications."
    },
    "FrontIII": {
      "title": "Front-End (III): Next.js",
      "description": "This advanced course delves into Next.js, a powerful React framework for building high-performance front-end applications. Participants will learn about key features such as server-side rendering, and dynamic routing. The course also covers advanced topics like API integration, optimized loading, and deploying Next.js applications. By the end of the course, students will be proficient in building sophisticated and scalable front-end applications using Next.js. Suitable for developers with React experience looking to enhance their skills in modern front-end development."
    },
    "Databases": {
      "title": "Databases with PostgreSQL",
      "description": "This course provides a comprehensive introduction to PostgreSQL, a powerful and open-source relational database system. Participants will learn how to design, implement, and manage databases. Topics include SQL queries and database design. By the end of the course, students will be able to handle data efficiently using PostgreSQL. Perfect for those interested in data management and back-end development."
    },
    "BackExpress": {
      "title": "Back-End with Express",
      "description": "This course introduces back-end web development using Express, a minimal and flexible Node.js framework. Participants will learn to create RESTful APIs, handle middleware, manage sessions, and connect to databases. By the end of the course, students will be able to build and deploy robust back-end services. Suitable for those with basic JavaScript knowledge looking to delve into server-side development."
    },
    "BackNext": {
      "title": "Back-End with Next.js",
      "description": "This advanced course explores the back-end capabilities of Next.js. Participants will learn about server actions, API routes, and integrating with databases. The course also covers best practices for building scalable and maintainable back-end systems. Ideal for developers who have completed the Front-End (III): Next.js course and want to leverage Next.js for full-stack development."
    },
    "IoTArduino": {
      "title": "Internet of Things (IoT) Fundamentals with Arduino",
      "description": "This course introduces the fundamentals of IoT using Arduino, an open-source electronics platform. Participants will learn to create connected devices, read sensors, control actuators, and communicate with other devices. By the end of the course, students will have built several IoT projects and gained a solid understanding of the principles of embedded systems. Perfect for beginners interested in electronics and IoT."
    },
    "IoTESP8266": {
      "title": "Internet of Things (IoT) Fundamentals with ESP8266",
      "description": "This course focuses on IoT development using the ESP8266, a low-cost Wi-Fi microchip. Participants will learn to program the ESP8266, connect to the internet, and build web-connected devices. The course covers various communication protocols and cloud integration. By the end of the course, students will be able to create sophisticated IoT projects with the ESP8266. Ideal for those with some experience in electronics and programming, looking to explore IoT further."
    }
  },
  "Development": {
    "title": "Web Application Development",
    "requirements": {
      "title": "Requirements",
      "phases": {
        "1": {
          "title": "First Meeting: Requirements Analysis",
          "description": "Define what the client needs and establish a clear vision of the project",
          "clientActions": {
            "1": "Describe the general idea of the project and its objectives.",
            "2": "Mention essential functionalities and specific needs.",
            "3": "Provide information about budget and estimated time."
          },
          "developerActions": {
            "1": "Ask questions to clarify requirements.",
            "2": "Take detailed notes and suggest possible technologies or approaches.",
            "3": "Lay the foundation for future documentation."
          }
        }
      }
    },
    "planning": {
      "title": "Planning",
      "phases": {
        "1": {
          "title": "Specifications Document and Technical Proposal",
          "description": "Formalize the requirements and establish an initial project roadmap.",
          "clientActions": {
            "1": "Review the document to confirm that all requirements are covered.",
            "2": "Provide feedback and suggest necessary adjustments."
          },
          "developerActions": {
            "1": "Draft a document including system description, functionalities, timeline, and cost estimation.",
            "2": "Propose work methodologies and tracking tools."
          }
        },
        "2": {
          "title": "Contract Signing and Scope Definition",
          "description": "Align expectations, costs, and deadlines through a formal agreement.",
          "clientActions": {
            "1": "Read, understand, and sign the contract.",
            "2": "Make the first payment or advance if applicable."
          },
          "developerActions": {
            "1": "Clearly define deliverables and deadlines.",
            "2": "Define communication and tracking channels and tools."
          }
        }
      }
    },
    "development": {
      "title": "Development",
      "phases": {
        "1": {
          "title": "Design and Prototyping",
          "description": "Create and validate the project's user interface (UI) and user experience (UX).",
          "clientActions": {
            "1": "Review presented sketches and wireframes.",
            "2": "Provide feedback to refine the design."
          },
          "developerActions": {
            "1": "Develop wireframes.",
            "2": "Adjust the design based on client feedback."
          }
        },
        "2": {
          "title": "Coding and System Construction",
          "description": "Implement the defined functionalities and structure the system's foundation.",
          "clientActions": {
            "1": "Review partial deliveries or system demos.",
            "2": "Validate that functionalities meet expectations and report observations."
          },
          "developerActions": {
            "1": "Write code, create software architecture, and configure the database.",
            "2": "Integrate modules and perform unit testing during development."
          }
        },
        "3": {
          "title": "Testing and Adjustments",
          "description": "Ensure the system works correctly and is error-free before deployment.",
          "clientActions": {
            "1": "Perform user tests in the development environment.",
            "2": "Report issues or necessary improvements."
          },
          "developerActions": {
            "1": "Conduct integration, compatibility, and security tests.",
            "2": "Fix bugs and optimize system performance."
          }
        }
      }
    },
    "deployment": {
      "title": "Deployment",
      "phases": {
        "1": {
          "title": "Production Environment Setup",
          "description": "Prepare the necessary infrastructure to host and run the application live.",
          "clientActions": {
            "1": "Define the domain for the application."
          },
          "developerActions": {
            "1": "Set up servers, domains, and databases in the production environment.",
            "2": "Perform final tests to ensure proper migration."
          }
        },
        "2": {
          "title": "Launch and Training",
          "description": "Put the application online and train the client for proper use.",
          "clientActions": {
            "1": "Verify the proper functioning of the system in production.",
            "2": "Participate in training sessions and review user manuals."
          },
          "developerActions": {
            "1": "Perform the final deployment and monitor initial system stability.",
            "2": "Provide documentation, manuals, and support for team training."
          }
        }
      }
    },
    "maintenance": {
      "title": "Maintenance",
      "phases": {
        "1": {
          "title": "Support and Continuous Monitoring",
          "description": "Ensure the system's stable operation and resolve any issues that may arise.",
          "clientActions": {
            "1": "Report problems or incidents in daily use.",
            "2": "Suggest improvements or new functionalities as the system is used."
          },
          "developerActions": {
            "1": "Continuously monitor system performance and security.",
            "2": "Provide technical support and fix detected errors or failures."
          }
        },
        "2": {
          "title": "Updates and Improvements",
          "description": "Keep the software updated and adapt it to changes or new business needs.",
          "clientActions": {
            "1": "Evaluate and propose new functionalities or periodic improvements.",
            "2": "Plan future update cycles together."
          },
          "developerActions": {
            "1": "Develop and implement security, performance, and new feature updates.",
            "2": "Perform post-update tests to ensure system stability."
          }
        }
      }
    }
  },
  "Students": {
    "title": "Students",
    "message": "These are the students who have taken my courses. They have shown great dedication and enthusiasm in learning and applying new concepts. I am proud to have been part of their educational journey.",
    "alertTitle": "Section in Development",
    "alertDescription": "This section is still under development. Soon you will be able to see the complete information.",
    "viewProfile": "View Profile",
    "about": "About",
    "completedCourse": "Completed Courses",
    "completed": "Completed",
    "viewProject": "View Final Project",
    "carlos-arevalo": "This is a generic description of a student. Here you can talk about your interests, skills and goals. You can also mention any relevant information about your professional or educational experience. This section can be as long as necessary.",
    "ejemplo-estudiante": "This is a generic description of a student. Here you can talk about your interests, skills and goals. You can also mention any relevant information about your professional or educational experience. This section can be as long as necessary.",
    "otro-nombre": "This is a generic description of a student. Here you can talk about your interests, skills and goals. You can also mention any relevant information about your professional or educational experience. This section can be as long as necessary.",
    "ultimo-estudiante": "This is a generic description of a student. Here you can talk about your interests, skills and goals. You can also mention any relevant information about your professional or educational experience. This section can be as long as necessary.",
    "courses": {
      "BasicsPython": "Basic Programming with Python",
      "Scratch": "Programming for kids with Scratch",
      "Matplotlib": "Data Visualization with Matplotlib",
      "FrontI": "Front-End (I): HTML, CSS & JavaScript",
      "FrontII": "Front-End (II): React, TypeScript & TailwindCSS",
      "FrontIII": "Front-End (III): Next.js",
      "Databases": "Databases with PostgreSQL",
      "BackExpress": "Back-End with Express",
      "BackNext": "Back-End with Next.js",
      "IoTArduino": "Internet of Things (IoT) Fundamentals with Arduino",
      "IoTESP8266": "Internet of Things (IoT) Fundamentals with ESP8266"
    }
  }
}
