{
  "HomePage": {
    "title": "Hola, soy",
    "description1": "+3 años de experiencia como ",
    "description2": "Desarrollador de Software",
    "description3": ". +500 ",
    "description4": "contribuciones en GitHub",
    "description5": " el año pasado. Pasión por crear soluciones innovadoras con tecnologías modernas. Como freelancer, he entregado con éxito proyectos de front-end y full-stack, cumpliendo consistentemente con los requisitos y plazos de los clientes. Mantenerme al tanto de las últimas tendencias tecnológicas asegura que mis habilidades se mantengan actualizadas. Con ganas de contribuir a proyectos impactantes y colaborar con equipos dinámicos. Espero con interés conectar y explorar cómo podemos crear algo excepcional juntos. ¡Empecemos!"
  },
  "Navbar": {
    "home": "Inicio",
    "developing": "Desarrollo",
    "courses": "Cursos"
  },
  "Projects": {
    "title": "Mis Proyectos",
    "infoButtonText": "Más info...",
    "liveButtonText": "Ver online",
    "backButton": "Atrás",
    "viewCodeButton": "Ver código",
    "projects": {
      "edf": {
        "description": "",
        "content": {
          "introduction": "Una plataforma web para EDF Academy, una institución innovadora dedicada a preparar a estudiantes de secundaria para la educación superior a través de herramientas de vanguardia como la Realidad Virtual.",
          "title1": "Dominio del Stack Tecnológico:",
          "p1": "Este proyecto fue un viaje increíble en el desarrollo web moderno, donde aproveché un robusto stack tecnológico:",
          "item1description": "para el desarrollo frontend dinámico y eficiente.",
          "item2description": "para un diseño elegante y receptivo.",
          "item3description": "framework y Vercel para un rendimiento óptimo y un despliegue sin problemas.",
          "item4description": "una colección versátil de componentes React basados en primitivas Radix para una mejor UI/UX.",
          "item5description": "para una gestión robusta de bases de datos.",
          "item6description": "para el almacenamiento confiable de imágenes y videos.",
          "title2": "Del Concepto a la Realidad:",
          "p2": "Mi papel abarcó todo el ciclo de vida del desarrollo, desde las reuniones iniciales con los fundadores de EDF Academy para comprender su visión, hasta la implementación y la integración de nuevas características adaptadas a las necesidades cambiantes de la academia.",
          "title3": "Creando Impacto:",
          "p3": "Este sitio web es más que un proyecto; es una puerta de entrada para que los estudiantes accedan a herramientas educativas innovadoras. Representa una fusión de tecnología y educación, allanando el camino para futuras experiencias de aprendizaje."
        }
      },
      "tutou": {
        "description": "Plataforma de Tutorías",
        "content": ""
      },
      "orientayt": {
        "description": "Plataforma de Tutorías (versión antigua)",
        "content": ""
      },
      "kidneyapp": {
        "description": "Control de Sesiones de Diálisis",
        "content": ""
      }
    }
  },
  "TechStack": {
    "title": "Stack Tecnológico",
    "tier1": "Stack Principal",
    "tier1description": "Tecnologías esenciales en mis proyectos actuales",
    "tier2": "Tecnologías Secundarias",
    "tier2description": "Tecnologías aprendidas y usadas en el pasado",
    "tier3": "Tecnologías Interesantes",
    "tier3description": "Tecnologías en las que tengo interés en aprender en el futuro"
  },
  "Services": {
    "title": "Mis Servicios",
    "learnButtonText": "Conoce más",
    "service1": "Tutorías Personalizadas",
    "service1description": "Ofrezco sesiones de tutoría personalizadas en diversas áreas del conocimiento de ciencias computacionales o matemáticas, adaptadas a tus necesidades específicas. Desde temas de para niños hasta universitarios, aseguro un aprendizaje dirigido y eficaz para cada estudiante.",
    "service2": "Cursos",
    "service2description": "Imparto cursos de programación en tecnologías front-end, back-end y full-stack, además de otras áreas. Estos cursos están diseñados para que obtengas bases sólidas y habilidades prácticas a través de proyectos que demuestren tu aprendizaje. Incluye certificado.",
    "service3": "Desarrollo de Aplicaciones Web a Medida",
    "service3description": "Como desarrollador experimentado, ofrezco servicios de diseño y desarrollo de aplicaciones web. Desde la conceptualización hasta el lanzamiento, manejo todos los aspectos técnicos para crear aplicaciones robustas y eficientes.",
    "service4": "Desarrollo y Gestión de Bases de Datos",
    "service4description": "Especializado en el diseño y manejo de bases de datos, ofrezco soluciones que garantizan la integridad, el rendimiento y la escalabilidad de los datos. Perfecto para negocios que requieren almacenamiento de datos avanzado y análisis en tiempo real."
  }
}
