{
  "HomePage": {
    "title": "Hola, soy",
    "description1": "+3 años de experiencia como ",
    "description2": "Desarrollador de Software",
    "description3": ". +500 ",
    "description4": "contribuciones en GitHub",
    "description5": " en el último año. Pasión por crear soluciones innovadoras con tecnologías modernas. Especializado en el desarrollo de aplicaciones web. Graduado de ",
    "description6": "Ingeniería en Tecnologías de la Información",
    "description7": " en la ",
    "description8": "Universidad Yachay Tech",
    "description9": ". A futuro me interesa profundizar en el mundo de la ",
    "description10": "Ciencia de Datos",
    "description11": " y la ",
    "description12": "Inteligencia Artificial",
    "description13": " para ampliar el impacto de mi trabajo. Espero con interés conectar y explorar cómo podemos crear algo excepcional juntos. ¡Empecemos!"
  },
  "Navbar": {
    "home": "Inicio",
    "development": "Desarrollo",
    "courses": "Cursos",
    "students": "Estudiantes"
  },
  "Projects": {
    "title": "Mis Proyectos",
    "infoButtonText": "Más info...",
    "liveButtonText": "Ver online",
    "backButton": "Atrás",
    "viewCodeButton": "Ver código",
    "projects": {
      "edf": {
        "description": "",
        "content": {
          "introduction": "Una plataforma web para EDF Academy, una institución innovadora dedicada a preparar a estudiantes de secundaria para la educación superior a través de herramientas de vanguardia como la Realidad Virtual.",
          "title1": "Dominio del Stack Tecnológico:",
          "p1": "Este proyecto fue un viaje increíble en el desarrollo web moderno, donde aproveché un robusto stack tecnológico:",
          "item1description": "para el desarrollo frontend dinámico y eficiente.",
          "item2description": "para un diseño elegante y receptivo.",
          "item3description": "framework y Vercel para un rendimiento óptimo y un despliegue sin problemas.",
          "item4description": "una colección versátil de componentes React basados en primitivas Radix para una mejor UI/UX.",
          "item5description": "para una gestión robusta de bases de datos.",
          "item6description": "para el almacenamiento confiable de imágenes y videos.",
          "title2": "Del Concepto a la Realidad:",
          "p2": "Mi papel abarcó todo el ciclo de vida del desarrollo, desde las reuniones iniciales con los fundadores de EDF Academy para comprender su visión, hasta la implementación y la integración de nuevas características adaptadas a las necesidades cambiantes de la academia.",
          "title3": "Creando Impacto:",
          "p3": "Este sitio web es más que un proyecto; es una puerta de entrada para que los estudiantes accedan a herramientas educativas innovadoras. Representa una fusión de tecnología y educación, allanando el camino para futuras experiencias de aprendizaje."
        }
      },
      "tutou": {
        "description": "Plataforma de Tutorías",
        "content": {
          "introduction": "Tuto-U ha completado exitosamente la transición de su fase de desarrollo a una plataforma web de tutoría entre pares totalmente operativa, revolucionando la forma en que los estudiantes de Yachay Tech participan en el aprendizaje colaborativo. Aquí tienes una visión general de sus características en evolución y logros:",
          "item1": "Plataforma de Tutoría entre Pares:",
          "item1desc": "Tuto-U ha establecido una comunidad dinámica donde los estudiantes se conectan para sesiones de tutoría, facilitando el intercambio de conocimientos y el aprendizaje colaborativo. Este ambiente empodera a los estudiantes permitiéndoles tanto enseñar como aprender, enriqueciendo su experiencia educativa.",
          "item2": "Estudiantes Tutores Empoderados:",
          "item2desc": "Siguiendo sus principios fundacionales, Tuto-U continúa permitiendo que los estudiantes sirvan como tutores. Este modelo de aprendizaje de pares no solo mejora la comprensión académica sino que también desarrolla habilidades de liderazgo y enseñanza entre los estudiantes.",
          "item3": "Tecnología Avanzada:",
          "item3desc": "Utilizando tecnologías modernas como React, TypeScript y Next.js, Tuto-U ofrece una experiencia de usuario robusta, escalable e intuitiva. La plataforma prioriza la accesibilidad y facilidad de navegación, haciéndola inclusiva para todos los usuarios.",
          "item4": "Impacto y Reconocimiento:",
          "item4desc": "Más allá de sus logros funcionales, Tuto-U ha ganado reconocimiento por su impacto social, participando notablemente en la competencia del Hult Prize. La plataforma busca abordar las disparidades educativas y fomentar una comunidad local de aprendices y educadores.",
          "item5": "Expandiendo Conexiones de Aprendizaje:",
          "item5desc": "La visión de Tuto-U se extiende hacia el cultivo de una red de conexiones expansiva dentro de la comunidad de aprendizaje de Yachay Tech. Aspira a crear oportunidades para el crecimiento compartido y el desarrollo a través de conexiones interdisciplinarias.",
          "item6": "Actualización de Estado:",
          "item6desc": "Tuto-U está en expansión activa, integrando continuamente nuevas características y mejoras para aumentar el compromiso de los usuarios y los resultados educativos.",
          "p2": "Esta evolución de OrientaYT a Tuto-U marca un hito significativo en nuestra misión de transformar las interacciones educativas y construir un mundo más conectado y educado."
        }
      },
      "orientayt": {
        "description": "Plataforma de Tutorías (versión antigua)",
        "content": {
          "introduction": "OrientaYT creó un ecosistema educativo basado en el apoyo mutuo. Era una plataforma de tutoría entre pares diseñada por estudiantes para estudiantes. Su misión era proporcionar a los estudiantes de Yachay Tech una comunidad en línea donde pudieran encontrar ayuda académica personalizada y colaborar en su desarrollo educativo.",
          "title1": "Cómo Funcionaba:",
          "p1": "OrientaYT era fácil de usar. Si un estudiante necesitaba asistencia, simplemente se registraba en la plataforma y buscaba tutores disponibles. Podían explorar los perfiles de los tutores, ver sus áreas de especialización y consultar sus horarios disponibles. Luego, seleccionaban a un tutor que se adaptara a sus necesidades y programaban una sesión de tutoría.",
          "p2": "Si un estudiante quería compartir su conocimiento, podía unirse al equipo de tutores voluntarios. Al convertirse en tutor, tenían la oportunidad de ayudar a sus compañeros, desarrollar su experiencia y obtener logros por su contribución.",
          "title2": "Screenshots:",
          "p3": "En resumen, OrientaYT fue un compañero de aprendizaje en línea, donde la comunidad se unía para ayudarse mutuamente a alcanzar el éxito académico. Fue un emocionante viaje educativo. ¡Bienvenidos al legado de OrientaYT!"
        }
      },
      "kidneyapp": {
        "description": "Control de Sesiones de Diálisis",
        "content": {
          "introduction": "Kidney app es una aplicación web que permite el control de sesiones de diálisis para pacientes con insuficiencia renal. Fue desarrollada para el Departamento de Nefrología de un hospital. Las principales características son:",
          "item1": "Registro de Pacientes:",
          "item1desc": "La aplicación permite el registro de pacientes con su información personal e historial médico.",
          "item2": "Control de Sesiones de Diálisis:",
          "item2desc": "La aplicación permite el registro de sesiones de diálisis para cada paciente, incluyendo la fecha, hora, parámetros clínicos y síntomas adicionales.",
          "item3": "Gráficos:",
          "item3desc": "La aplicación permite la visualización de gráficos con datos de las sesiones de diálisis de cada paciente en una línea de tiempo con parámetros clínicos.",
          "item4": "Tecnología Utilizada:",
          "item4desc": "La plataforma está construida usando tecnologías de punta como React, TypeScript y Next.js. Esto asegura una aplicación robusta, escalable y amigable para el usuario. El enfoque en la experiencia del usuario y la accesibilidad es primordial, haciendo que la aplicación sea inclusiva y fácil de navegar.",
          "p1": "Obviamente estos son datos ficticios, respetando la privacidad del paciente. Los datos recuperados se almacenan en una base de datos SQLite local para que puedan ser utilizados en el futuro para análisis e investigación por el Departamento de Nefrología utilizando algoritmos de Inteligencia Artificial y Aprendizaje Automático para mejorar la calidad de vida de los pacientes con insuficiencia renal y para prevenir una insuficiencia renal completa.",
          "p2": "De todos modos, subí una versión funcional de la aplicación en GitHub, para que puedas revisarla y experimentar con ella. Espero que te guste"
        }
      }
    }
  },
  "Experiences": {
    "title": "Mis Experiencias",
    "moreInfo": "Más info...",
    "viewCertificate": "Ver certificado",
    "back": "Atrás",
    "1": {
      "title": "Miembro de Junta Directiva",
      "type": "trabajo",
      "date": "Oct 2020 - Oct 2021",
      "location": "Club de Ciencias Computacionales de la Universidad Yachay Tech",
      "description": "Director del Departamento de Comunicación en el club de la carrera de Ingeniería en TICs / Ciencias Computacionales."
    },
    "2": {
      "title": "Ponente y Asistente en el Seminario de Fundamentos de Ingeniería de Software",
      "type": "evento",
      "date": "May - Jul 2021",
      "location": "Grupo de Investigación SDAS",
      "description": "Contribución a sesiones sobre principios de ingeniería de software."
    },
    "3": {
      "title": "Tutor en Proyecto Hamilton Tech",
      "type": "evento",
      "date": "Nov - Dic 2021",
      "location": "Club de Ciencias Computacionales de la Universidad Yachay Tech",
      "description": "Mentoría a estudiantes de secundaria en temas de computación."
    },
    "4": {
      "title": "Ponente en Exposición de Visión Computacional 2.0",
      "type": "evento",
      "date": "Dic 7, 2021",
      "location": "IEEE Computer Society Universidad Yachay Tech",
      "description": "Presenté un póster sobre una aplicación de reconocimiento de gestos basada en el ejemplo de Android de TensorFlow Lite."
    },
    "5": {
      "title": "Seminario de Ingeniería de Software y Ciencias Computacionales",
      "type": "evento",
      "date": "Mar 21 - 25, 2022",
      "location": "",
      "description": "Organizado por el Club de Software ESPE Latacunga, el Club de Ciencias Computacionales de la Universidad Yachay Tech, el Capítulo Técnico de la Computer Society ESPE Latacunga y el Capítulo Técnico de la Computer Society Yachay Tech."
    },
    "6": {
      "title": "Fundamentos de IA Generativa",
      "type": "curso",
      "date": "Jun 14, 2022",
      "location": "Google Cloud Skills Boost",
      "description": "Certificación en conocimientos fundamentales de IA generativa y sus aplicaciones."
    },
    "7": {
      "title": "Pasantía como Desarrollador de Software",
      "type": "trabajo",
      "date": "Jun - Dic 2022",
      "location": "TALOV",
      "description": "Preprocesamiento de un conjunto de datos de lenguaje de señas con aumento de datos. Recopilación de puntos clave de fotogramas de video. Modelado de una red neuronal LSTM y entrenamiento con los puntos clave obtenidos. Uso de TFLite para crear un modelo ligero que sería usado en una aplicación móvil creada en Flutter por otro equipo de desarrollo."
    },
    "8": {
      "title": "Presentación Poster Científico",
      "type": "evento",
      "date": "Jul 10, 2023",
      "location": "I Congreso Internacional de Educación, Ciencias, Innovación y Sociedad (CIECIS23)",
      "description": "Presenté un póster titulado 'Tutoring Sessions Yachay Tech: aplicación web para impulsar aprendizaje colectivo' donde destaco los resultados de mi proyecto OrientaYT."
    },
    "9": {
      "title": "NestJS: La Guía Completa del Desarrollador",
      "type": "curso",
      "date": "Feb 17, 2024",
      "location": "Udemy",
      "description": "He completado un curso de 20 horas de NestJS para backend, profundizando en TypeORM y ampliando mi comprensión de TypeScript, más allá del tipado de variables. Esta experiencia me ha permitido fortalecer mis habilidades en arquitectura backend, desarrollo modular y mejores prácticas en aplicaciones escalables."
    }
  },
  "TechStack": {
    "title": "Stack Tecnológico",
    "tier1": "Stack Principal",
    "tier1description": "Tecnologías esenciales en mis proyectos actuales",
    "tier2": "Tecnologías Secundarias",
    "tier2description": "Tecnologías aprendidas y usadas en el pasado",
    "tier3": "Tecnologías Interesantes",
    "tier3description": "Tecnologías en las que tengo interés en aprender en el futuro"
  },
  "Services": {
    "title": "Mis Servicios",
    "learnButtonText": "Conoce más",
    "service1": "Tutorías Personalizadas",
    "service1description": "Ofrezco sesiones de tutoría personalizadas en diversas áreas del conocimiento de ciencias computacionales o matemáticas, adaptadas a tus necesidades específicas. Desde temas de para niños hasta universitarios, aseguro un aprendizaje dirigido y eficaz para cada estudiante.",
    "service2": "Cursos",
    "service2description": "Imparto cursos de programación en tecnologías front-end, back-end y full-stack, además de otras áreas. Estos cursos están diseñados para que obtengas bases sólidas y habilidades prácticas a través de proyectos que demuestren tu aprendizaje. Incluye certificado.",
    "service3": "Desarrollo de Aplicaciones Web a Medida",
    "service3description": "Como desarrollador experimentado, ofrezco servicios de diseño y desarrollo de aplicaciones web. Desde la conceptualización hasta el lanzamiento, manejo todos los aspectos técnicos para crear aplicaciones robustas y eficientes.",
    "service4": "Desarrollo y Gestión de Bases de Datos",
    "service4description": "Especializado en el diseño y manejo de bases de datos, ofrezco soluciones que garantizan la integridad, el rendimiento y la escalabilidad de los datos. Perfecto para negocios que requieren almacenamiento de datos avanzado y análisis en tiempo real."
  },
  "Courses": {
    "title": "Mis Cursos",
    "viewMore": "Ver más",
    "comingSoon": "Próximamente",
    "comingSoonDescription": "Aún se está integrando la página de este curso, pero puedes contactarte directamente conmigo si necesitas información.",
    "BasicsPython": {
      "title": "Programación Básica con Python",
      "description": "Este curso introduce los fundamentos de la programación utilizando Python, uno de los lenguajes de programación más populares y versátiles. Los participantes aprenderán conceptos básicos como variables, estructuras de control, funciones y tipos de datos. Al final del curso, los estudiantes podrán escribir programas simples, resolver problemas de manera algorítmica y comprender los principios fundamentales de la codificación. Ideal para principiantes sin experiencia previa en programación.",
      "time": "horas",
      "place": "En vivo",
      "difficulty": "Principiante",
      "certificate": "Incluye certificado",
      "learningObjective": {
        "title": "Objetivos de Aprendizaje",
        "1": "Comprender e implementar conceptos básicos de programación",
        "2": "Escribir y depurar programas en Python",
        "3": "Desarrollar habilidades para resolver problemas a través de experiencias prácticas",
        "4": "Crear código robusto y mantenible"
      },
      "lectures": "clases",
      "workshops": "talleres",
      "assessments": "evaluaciones",
      "project": "proyecto",
      "investment": "inversión",
      "prerequisites": "Requisitos Previos",
      "req": {
        "1": "Ninguno"
      },
      "content": "Contenido",
      "lecture": "Clase",
      "workshop": "Taller",
      "assessment": "Evaluación",
      "lecturesData": {
        "1": "Introducción a la Programación y Python",
        "2": "Variables y Tipos de Datos",
        "3": "Estructuras de control: condicionales y bucles",
        "4": "Introducción a las funciones",
        "5": "Listas",
        "6": "Trabajando con Cadenas de Texto",
        "7": "Lectura/Escritura de Archivos",
        "8": "Manejo de Errores"
      },
      "workshopsData": {
        "1": "Escribiendo Tu Primer Programa en Python",
        "2": "Trabajando con Variables y Tipos de Datos",
        "3": "Implementación de Estructuras de Control",
        "4": "Creación y Uso de Funciones",
        "5": "Creación de Arreglos y Matrices",
        "6": "Manipulación Práctica de Cadenas de Texto",
        "7": "Operaciones de Entrada y Salida de Archivos",
        "8": "Escribiendo Programas Robustos con Manejo de Errores"
      },
      "finalProject": "Proyecto Final",
      "obtainCertificate": "Obtener Certificado"
    },
    "Scratch": {
      "title": "Programación para niños con Scratch",
      "description": "Diseñado para jóvenes aprendices, este curso utiliza Scratch, un lenguaje de programación visual que hace que la codificación sea divertida e interactiva. Los niños aprenderán los conceptos básicos de la programación creando sus propios juegos, animaciones e historias interactivas. Este curso fomenta la creatividad, el pensamiento lógico y las habilidades para resolver problemas en un entorno atractivo y de apoyo. Perfecto para niños de 8 a 14 años.",
      "time": "horas",
      "place": "En vivo",
      "difficulty": "Principiante",
      "certificate": "Incluye certificado",
      "learningObjective": {
        "title": "Objetivos de Aprendizaje",
        "1": "Comprender los conceptos básicos de programación utilizando el lenguaje visual de Scratch",
        "2": "Crear historias interactivas, juegos y animaciones usando Scratch",
        "3": "Desarrollar habilidades para resolver problemas al construir proyectos",
        "4": "Ganar confianza en la presentación y explicación de proyectos de codificación"
      },
      "lectures": "clases",
      "workshops": "talleres",
      "assessments": "evaluaciones",
      "project": "proyecto",
      "projects": "proyectos",
      "investment": "inversión",
      "discounts": "Descuentos",
      "discountsDescription": "Revisa los precios por número de estudiantes",
      "students": "estudiantes",
      "discountsNote": "El número máximo de estudiantes por curso es de 4. Esto asegura la calidad del aprendizaje para cada estudiante",
      "prerequisites": "Requisitos previos",
      "req": {
        "1": "Ninguno"
      },
      "content": "Contenido",
      "lecture": "Clase",
      "workshop": "Taller",
      "assessment": "Evaluación",
      "lecturesData": {
        "1": "Introducción a Scratch y la interfaz de Scratch",
        "2": "Comprensión de Eventos y Controles",
        "3": "Introducción a Variables y Bucles",
        "4": "Añadiendo Sonidos y Música a Proyectos",
        "5": "Uso de Declaraciones Condicionales",
        "6": "Introducción a la Difusión y Clonación"
      },
      "workshopsData": {
        "1": "Creación de tu Primer Proyecto en Scratch: Haz que un Sprite se Mueva",
        "2": "Creación de Animaciones Interactivas con Eventos",
        "3": "Construcción de un Juego Simple con Variables",
        "4": "Creación de un Juego basado en Música",
        "5": "Creación de una Historia de Aventuras con Elecciones",
        "6": "Construcción de un Juego Multijugador"
      },
      "projectM": "Proyecto",
      "obtainCertificate": "Obtener Certificado"
    },
    "Matplotlib": {
      "title": "Visualización de Datos con Matplotlib",
      "description": "Este curso se centra en el arte de la visualización de datos utilizando Matplotlib, una potente biblioteca de Python. Los estudiantes aprenderán a crear una amplia variedad de visualizaciones estáticas, animadas e interactivas. Los temas incluyen la creación de gráficos básicos, la personalización de gráficos, el trabajo con múltiples figuras y subgráficos, y la integración con otras bibliotecas de análisis de datos. Ideal para quienes desean transformar datos en información valiosa mediante representaciones visuales atractivas."
    },
    "FrontI": {
      "title": "Front-End (I): HTML, CSS y JavaScript",
      "description": "Este curso introductorio cubre las tecnologías esenciales para la construcción de páginas web. Los participantes aprenderán HTML para la estructura, CSS para el diseño y JavaScript para la interactividad. Al finalizar el curso, los estudiantes serán capaces de crear páginas web dinámicas y adaptables desde cero. Este curso es perfecto para principiantes que desean iniciar su camino en el desarrollo web."
    },
    "FrontII": {
      "title": "Front-End (II): React, TypeScript y TailwindCSS",
      "description": "Basándose en habilidades básicas de desarrollo web, este curso aborda el desarrollo front-end moderno con React, TypeScript y TailwindCSS. Los participantes aprenderán a crear interfaces de usuario complejas y escalables con React, garantizar la calidad del código y la seguridad de tipos con TypeScript, y diseñar aplicaciones de manera eficiente con TailwindCSS. Ideal para quienes buscan avanzar en el desarrollo front-end y trabajar en aplicaciones web de nivel profesional."
    },
    "FrontIII": {
      "title": "Front-End (III): Next.js",
      "description": "Este curso avanzado profundiza en Next.js, un potente framework de React para construir aplicaciones front-end de alto rendimiento. Los participantes aprenderán sobre características clave como el renderizado del lado del servidor y el enrutamiento dinámico. El curso también aborda temas avanzados como la integración de APIs, la carga optimizada y la implementación de aplicaciones Next.js. Al finalizar, los estudiantes serán competentes en la construcción de aplicaciones front-end sofisticadas y escalables con Next.js. Adecuado para desarrolladores con experiencia en React que deseen mejorar sus habilidades en desarrollo front-end moderno."
    },
    "Databases": {
      "title": "Bases de Datos con PostgreSQL",
      "description": "Este curso ofrece una introducción integral a PostgreSQL, un sistema de bases de datos relacional potente y de código abierto. Los participantes aprenderán a diseñar, implementar y gestionar bases de datos. Los temas incluyen consultas SQL y diseño de bases de datos. Al finalizar el curso, los estudiantes podrán gestionar datos de manera eficiente utilizando PostgreSQL. Perfecto para quienes estén interesados en la gestión de datos y el desarrollo de back-end."
    },
    "BackExpress": {
      "title": "Back-End con Express",
      "description": "Este curso introduce el desarrollo web de back-end utilizando Express, un framework minimalista y flexible para Node.js. Los participantes aprenderán a crear APIs RESTful, manejar middleware, gestionar sesiones y conectar con bases de datos. Al finalizar el curso, los estudiantes podrán construir y desplegar servicios de back-end robustos. Adecuado para quienes tengan conocimientos básicos de JavaScript y deseen profundizar en el desarrollo del lado del servidor."
    },
    "BackNext": {
      "title": "Back-End con Next.js",
      "description": "Este curso avanzado explora las capacidades de back-end de Next.js. Los participantes aprenderán sobre acciones del servidor, rutas de API e integración con bases de datos. El curso también cubre las mejores prácticas para construir sistemas de back-end escalables y mantenibles. Ideal para desarrolladores que hayan completado el curso Front-End (III): Next.js y quieran aprovechar Next.js para el desarrollo full-stack."
    },
    "IoTArduino": {
      "title": "Fundamentos de IoT con Arduino",
      "description": "Este curso introduce los fundamentos de IoT utilizando Arduino, una plataforma de electrónica de código abierto. Los participantes aprenderán a crear dispositivos conectados, leer sensores, controlar actuadores y comunicarse con otros dispositivos. Al finalizar el curso, los estudiantes habrán construido varios proyectos de IoT y adquirido una sólida comprensión de los principios de sistemas embebidos. Perfecto para principiantes interesados en electrónica e IoT."
    },
    "IoTESP8266": {
      "title": "Fundamentos de IoT con ESP8266",
      "description": "Este curso se centra en el desarrollo de IoT utilizando el ESP8266, un microchip Wi-Fi de bajo costo. Los participantes aprenderán a programar el ESP8266, conectarse a internet y construir dispositivos conectados a la web. El curso abarca diversos protocolos de comunicación e integración con la nube. Al finalizar, los estudiantes serán capaces de crear proyectos de IoT sofisticados con el ESP8266. Ideal para quienes tengan algo de experiencia en electrónica y programación y deseen explorar más a fondo el IoT."
    }
  },
  "Development": {
    "title": "Desarrollo de Aplicaciones Web",
    "clientActions": "Acciones del Cliente",
    "developerActions": "Acciones del Desarrollador",
    "requirements": {
      "title": "Requerimientos",
      "phases": {
        "1": {
          "title": "Primera Reunión: Análisis de Requerimientos",
          "description": "Definir qué necesita el cliente y establecer una visión clara del proyecto",
          "clientActions": {
            "1": "Describir la idea general del proyecto y sus objetivos.",
            "2": "Mencionar funcionalidades esenciales y necesidades específicas.",
            "3": "Proporcionar información sobre presupuesto y tiempo estimado."
          },
          "developerActions": {
            "1": "Realizar preguntas para clarificar requerimientos.",
            "2": "Tomar notas detalladas y sugerir posibles tecnologías o enfoques.",
            "3": "Establecer la base para la documentación futura."
          }
        }
      }
    },
    "planning": {
      "title": "Planificación",
      "phases": {
        "1": {
          "title": "Documento de Especificaciones y Propuesta Técnica",
          "description": "Formalizar los requerimientos y establecer una hoja de ruta inicial del proyecto.",
          "clientActions": {
            "1": "Revisar el documento para confirmar que todos los requerimientos están contemplados.",
            "2": "Proveer retroalimentación y sugerir ajustes necesarios."
          },
          "developerActions": {
            "1": "Redactar un documento que incluya descripción del sistema, funcionalidades, cronograma y estimación de costos.",
            "2": "Proponer metodologías de trabajo y herramientas de seguimiento."
          }
        },
        "2": {
          "title": "Firma de Contrato y Definición del Alcance",
          "description": "Alinear expectativas, costos y plazos mediante un acuerdo formal.",
          "clientActions": {
            "1": "Leer, entender y firmar el contrato.",
            "2": "Realizar el primer pago o adelanto si aplica."
          },
          "developerActions": {
            "1": "Establecer claramente los entregables y los tiempos de entrega.",
            "2": "Definir canales y herramientas de comunicación y seguimiento."
          }
        }
      }
    },
    "development": {
      "title": "Desarrollo",
      "phases": {
        "1": {
          "title": "Diseño y Prototipado",
          "description": "Crear y validar la interfaz de usuario (UI) y la experiencia de usuario (UX) del proyecto.",
          "clientActions": {
            "1": "Revisar bocetos y wireframes presentados.",
            "2": "Proporcionar feedback para refinar el diseño."
          },
          "developerActions": {
            "1": "Desarrollar wireframes.",
            "2": "Ajustar el diseño de acuerdo a los comentarios del cliente."
          }
        },
        "2": {
          "title": "Codificación y Construcción del Sistema",
          "description": "Implementar las funcionalidades definidas y estructurar la base del sistema.",
          "clientActions": {
            "1": "Revisar entregas parciales o demos del sistema.",
            "2": "Validar que las funcionalidades se ajusten a lo esperado y reportar observaciones."
          },
          "developerActions": {
            "1": "Escribir el código, crear la arquitectura del software y configurar la base de datos.",
            "2": "Integrar módulos y realizar pruebas unitarias durante el desarrollo."
          }
        },
        "3": {
          "title": "Pruebas y Ajustes",
          "description": "Garantizar que el sistema funcione correctamente y esté libre de errores antes de su despliegue.",
          "clientActions": {
            "1": "Ejecutar pruebas de usuario en el entorno de desarrollo.",
            "2": "Reportar incidencias o mejoras necesarias."
          },
          "developerActions": {
            "1": "Realizar pruebas de integración, compatibilidad y seguridad.",
            "2": "Corregir errores y optimizar el rendimiento del sistema."
          }
        }
      }
    },
    "deployment": {
      "title": "Despliegue",
      "phases": {
        "1": {
          "title": "Configuración del Entorno de Producción",
          "description": "Preparar la infraestructura necesaria para alojar y ejecutar la aplicación en vivo.",
          "clientActions": {
            "1": "Definir el dominio para la aplicación."
          },
          "developerActions": {
            "1": "Configurar servidores, dominios y bases de datos en el entorno de producción.",
            "2": "Realizar pruebas finales para garantizar la correcta migración."
          }
        },
        "2": {
          "title": "Lanzamiento y Capacitación",
          "description": "Poner la aplicación en línea y capacitar al cliente para su uso correcto.",
          "clientActions": {
            "1": "Verificar el correcto funcionamiento del sistema en producción.",
            "2": "Participar en sesiones de capacitación y revisión de manuales de uso."
          },
          "developerActions": {
            "1": "Realizar el despliegue final y monitorear la estabilidad inicial del sistema.",
            "2": "Proveer documentación, manuales y soporte para la capacitación del equipo."
          }
        }
      }
    },
    "maintenance": {
      "title": "Mantenimiento",
      "phases": {
        "1": {
          "title": "Soporte y Monitoreo Continuo",
          "description": "Asegurar la operación estable del sistema y resolver incidencias que puedan surgir.",
          "clientActions": {
            "1": "Reportar problemas o incidencias en el uso diario.",
            "2": "Sugerir mejoras o nuevas funcionalidades conforme se utilice el sistema."
          },
          "developerActions": {
            "1": "Monitorear el rendimiento y la seguridad del sistema de manera continua.",
            "2": "Proveer soporte técnico y solucionar errores o fallos detectados."
          }
        },
        "2": {
          "title": "Actualizaciones y Mejoras",
          "description": "Mantener el software actualizado y adaptarlo a cambios o nuevas necesidades del negocio.",
          "clientActions": {
            "1": "Evaluar y proponer nuevas funcionalidades o mejoras periódicas.",
            "2": "Planificar en conjunto futuros ciclos de actualización."
          },
          "developerActions": {
            "1": "Desarrollar e implementar actualizaciones de seguridad, rendimiento y nuevas funcionalidades.",
            "2": "Realizar pruebas posteriores a cada actualización para garantizar la estabilidad del sistema."
          }
        }
      }
    }
  },
  "Students": {
    "title": "Estudiantes",
    "message": "Estos son los alumnos que han seguido mis cursos. Han demostrado una gran dedicación y entusiasmo a la hora de aprender y aplicar nuevos conceptos. Estoy orgulloso de haber formado parte de su viaje educativo.",
    "alertTitle": "Sección en Desarrollo",
    "alertDescription": "Esta sección aún se encuentra en desarrollo. Próximamente podrás ver la información completa.",
    "viewProfile": "Ver Perfil",
    "about": "Acerca",
    "completedCourse": "Cursos Completados",
    "completed": "Completado",
    "viewProject": "Ver Proyecto Final",
    "carlos-arevalo": "Esta es una descripción genérica de un estudiante. Aquí se puede hablar de sus intereses, habilidades y metas. También se puede mencionar cualquier información relevante sobre su experiencia profesional o educativa. Esta sección puede ser tan larga como sea necesario.",
    "ejemplo-estudiaante": "Esta es una descripción genérica de un estudiante. Aquí se puede hablar de sus intereses, habilidades y metas. También se puede mencionar cualquier información relevante sobre su experiencia profesional o educativa. Esta sección puede ser tan larga como sea necesario.",
    "otro-nombre": "Esta es una descripción genérica de un estudiante. Aquí se puede hablar de sus intereses, habilidades y metas. También se puede mencionar cualquier información relevante sobre su experiencia profesional o educativa. Esta sección puede ser tan larga como sea necesario.",
    "ultimo-estudiante": "Esta es una descripción genérica de un estudiante. Aquí se puede hablar de sus intereses, habilidades y metas. También se puede mencionar cualquier información relevante sobre su experiencia profesional o educativa. Esta sección puede ser tan larga como sea necesario.",
    "courses": {
      "BasicsPython": "Programación Básica con Python",
      "Scratch": "Programación para niños con Scratch",
      "Matplotlib": "Visualización de Datos con Matplotlib",
      "FrontI": "Front-End (I): HTML, CSS y JavaScript",
      "FrontII": "Front-End (II): React, TypeScript y TailwindCSS",
      "FrontIII": "Front-End (III): Next.js",
      "Databases": "Bases de Datos con PostgreSQL",
      "BackExpress": "Back-End con Express",
      "BackNext": "Back-End con Next.js",
      "IoTArduino": "Fundamentos de IoT con Arduino",
      "IoTESP8266": "Fundamentos de IoT con ESP8266"
    }
  }
}
